Tekla Open API Reference for Tekla Structures 2025
PourBreak.Attributes Property
 The attributes of the pour break. For more information see PourBreak.PourBreakAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PourBreak.PourBreakAttributes Attributes { get; set; }
Public Property Attributes As PourBreak.PourBreakAttributes
	Get
	Set
Property Value
Type: PourBreak.PourBreakAttributes
See Also
Reference
PourBreak Class
Tekla.Structures.Drawing Namespace